{"NORMAL":"normal","ABOUT":"About","OPTIONS":"Options","HOME":"Home","VISION_SIMULATOR":"Vision simulator","COLOR_PICKER":"Color picker","AR_MODE":"A.R. mode","CLASSIC_MODE":"classic Mode","DEUTERANOMALY":"deuteranomaly","DEUTERANOPIA":"deuteranopia","PROTANOMALY":"protanomaly","PROTANOPIA":"protanopia","TRITANOPIA":"tritanopia","ACHROMATOPSIA":"achromatopsia","ENCYCLOPEDIA":"Encyclopedia","BACK":"back","NEXT":"next","RESTART":"restart","START":"start","RESULTS":"results","BACK_TO_MENU":"Back to menu","EXPECTED":"Expected","YOUR_ANSWERS":"Your answers","COMPLETE_TEST":"complete test","YOUR_RESULT":"your result","TEST_ISHIHARA_NORMAL":"Normal vision","TEST_ISHIHARA_PROBLEM":"Diagnostic problem","TEST_ISHIHARA_COLOR_BLIND":"Color blind vision","TEST_ISHIHARA_PROTANOMALY":"Protanomaly suspected","TEST_ISHIHARA_DEUTERANOMALY":"Deuteranomaly suspected","TEST_ISHIHARA_COLOR_DEFICIENCY":"Color deficiency suspected","SHORT_TEST":"short test","CHANGE_THEME":"change color theme","CHANGE_LANGUAGE":"change language","RED":"red","PINK":"pink","ORANGE":"orange","YELLOW":"yellow","GREEN":"green","BLUE":"blue","VIOLET":"purple","BEIGE":"beige","BROWN":"brown","BLACK":"black","GREY":"grey","WHITE":"white","DARK_RED":"dark red","LIGHT_PINK":"light pink","DARK_PINK":"dark pink","LIGHT_GREEN":"light green","DARK_GREEN":"dark green","BLUE_GREEN":"blue - green","LIGHT_BLUE":"light blue","DARK_BLUE":"dark blue","DARK_GREY":"dark grey","CLOSE":"close","TEST_ISHIHARA_SHOULD_PRECISE":"Suspected abnormality. Complete test recommended","NO_NUMBER":"no number","TOPIC_HEADER_COLORBLINDNESS":"Disorders of color vision","TOPIC_HEADER_TESTS":"Explanation of tests","INTRODUCTION_TITLE":"Introduction","INTRODUCTION_CONTENT":"<p>The retinal cells enable the eye to collect and visualize basic colours (red, green, blue). After that, these cells transmit information to the brain through the optic nerve in a region of the cerebral cortex especially dedicated to color recognition.<br \/> The vision deficiencies are called dyschromatopsias.<\/p>\n<p>They are hereditary, such as color blindness, or acquired after an eye disease.<\/p>","DALTONISM_TITLE":"Daltonism - inherited dyschromatopsias","DALTONISM_CONTENT":"<p>The frequency of daltonism is, on average, 8% among men and 0.5% among women.<br \/> This disparity is due to the fact that the gene of daltonism is carried by the X sex chromosome and is recessive. What this means is simply that the presence of a normal gene for the abnormality is not expressed.<\/p>\n<p>A woman with two X chromosomes, will be color blind only if both chromosomes inherited from both parents carry the defective gene which is indeed a rare event.<\/p>\n<p>However, a man with only one X chromosome, inherited from his mother, will be color blind if that X chromosome has the abnormal gene on it.<\/p>\n<p>In Daltonism, all 3 cones are lacking.<\/p>","DICROMATE_TITLE":"Dichromacy ","DICROMATE_CONTENT":"<p>One of the cones is absent, and vision will involve only the two remaining colors instead of the three normally used.<\/p>\n<ul>\n<li><strong>protanopia or red-dichromacy<\/strong>: these people sees only green and blue. People suffering from protanopia are unable to perceive red light.<\/li>\n<li><strong>deuteranopia<\/strong>: (most common) these people sees only the red and the blue. People suffering from deuteranopia are unable to perceive green light.<\/li>\n<li><strong>tritanopia<\/strong>: these persons sees only the red and green. People suffering from tritanopia are unable to perceive blue light.<\/li>\n<\/ul>","TRICHROMATE_TITLE":"Anomalous trichromacy or anomalous trichromatic vision","TRICHROMATE_CONTENT":"<p>In people with this condition, all of their three cones types are used to perceive light colours but one type of cone perceives light slightly out of alignment.<\/p>\n<ul>\n<li><strong>protanomal<\/strong>: is a reduced sensitivity to red light<\/li>\n<li><strong>deuteranomal<\/strong>: is a reduced sensitivity to green light<\/li>\n<li><strong>tritanomal<\/strong>: is a reduced sensitivity to blue light and is extremely rare.<\/li>\n<\/ul>\n<p>Normal colour vision uses all three types of light cones correctly and is known as trichromacy. People with normal colour vision are known as trichromats.<\/p>","ACHROMATE_TITLE":"Achromatopsia","ACHROMATE_CONTENT":"<p>Achromatopsia is a condition characterized by a partial or total absence of color vision. People with complete achromatopsia cannot perceive any colors; they see only black, white, and shades of gray. Incomplete achromatopsia is a milder form of the condition that allows some color discrimination.<\/p>\n<p>In people with complete achromatopsia, cones are nonfunctional, and vision depends entirely on the activity of rods (which provide vision in low light as night vision). The loss of cone function leads to a total lack of color vision and causes the other vision problems (cones provide vision in bright light as daylight vision), including color vision.<\/p>\n<p>Achromatopsia also involves other problems with vision, including an increased sensitivity to light and glare (photophobia), involuntary back-and-forth eye movements (nystagmus), and significantly reduced sharpness of vision (low visual acuity). Affected individuals can also have farsightedness (hyperopia) or, less commonly, nearsightedness (myopia). These vision problems develop in the first few months of life.<\/p>","ACQUIRED_TITLE":"Acquired dyschromatopsias","ACQUIRED_CONTENT":"<p>This corresponds to a consecutive disturbance of the eye disease. The color vision changes often appear early in the disease, and can be curable.<\/p>","ISHIHARA_TITLE":"Ishihara Test","ISHIHARA_CONTENT":"<p>This test was created in 1917 by Shinobu Ishihara.<\/p>\n<p>It consists of 38 plates called \"pseudoisochromatic\" or plates made of small colored dots forming a background on which appears a symbol (letter or number).<\/p>\n<p>The unaffected patient dyschromatopsia clearly see the symbol, while the person with color vision deficiency is unable to read the symbol.<\/p>\n<p>Its purpose is to highlight the existence of color blindness if it exists, and its axis. It does not assess the severity of the disability.<\/p>","ISHIHARA_MORE":"<p>Additional information: this album consists of 38 plates where the images can be numbers (1 to 25 plates with numbers) or contain one or two wiggly or winding lines (plates 26-38 for people not reading numbers). The plates can be of different types:<\/p>\n<ul>\n<li>Demonstration plate (plate number one and plate number 38); designed to be visible by all persons, whether normal or color vision deficient. For demonstration purposes only, and usually not considered in making a score for screening purpose.<\/li>\n<li>Vanishing design: only people with normal color vision can recognize the sign. If you are colorblind you won&rsquo;t see anything.<\/li>\n<li>Transformation design: people with a color vision deficiency will see a different sign than people with no color vision deficiency.<\/li>\n<li>Hidden digit design: only people with a color vision deficiency are able to spot the sign. If you have a normal color vision, you won&rsquo;t be able to see it.<\/li>\n<li>Classification design: this is used to differentiate between red- and green-vision deficiency persons. The vanishing design is used on either side of the plate, one side for deutan defect (deuteranopia) and the other for protans defect (protanopia).<\/li>\n<\/ul>\n<p>There are no quantitative diagnostic plates, plates without images, or blue-yellow axis plates. The subject is considered normal, if he\/she can read at least 17 of the 21 digits plates, and abnormal if it reads less than 13 plates.<\/p>","FARNSWORTH_TITLE":"100 HUE Farnsworth test","FARNSWORTH_CONTENT":"<p>The Farnsworth test is a color arrangement test, developed by Dean Farnsworth in 1943.<\/p>\n<p>The test is based to the arrangement of the colors in order, according to similarity hues, in order to form a serie of gradient colors.<\/p>\n<p>It thus highlights an \"axis of confusion\" because the patient with color vision deficiency will classify the colors incorrectly.<\/p>\n<p>This test is designed to give a quick assessment of color vision deficiency, and should not replace evaluation by a professional.<\/p>","MODAL_SIMULATOR":"<p>This tool will simulate the experience of persons suffering from any form of color blindness.<\/p>\n<p>Through the camera of your device, you will see what these persons see. Six visual conditions have been simulated. More information about these disorders are available in the encyclopedia section.<\/p>","MODAL_COLOR_PICKER":"<p>This tool allows you to identify and name the colors you see. It recognizes the selected color using the camera of your device and gives you its exact name. This tool can help people with visual disabilities to identify the color when choosing their clothes, or when necessary.<\/p>","DISCLAIMER":"Please consult your opthalmologist. This app is not a medical device and therefore is not 100% accurate.","LAST_MODIFIED":"Last modified","CREATED_AT":"Created at","ABOUT_PAGE":"<h2>About&nbsp;Color Vision Quiz<\/h2>\n<p>This application was created and developed by the Health On the Net Foundation (HON), as part of a collaboration with the Pro Visu Foundation for the promotion and prevention of vision problems. The HON Foundation is specialized in the promotion and guidance of trustworthy online health information.<\/p>\n<p>More on HON:&nbsp; <a class=\"button--quiet\">https:\/\/hon.ch\/20-years\/en\/about.html<\/a><\/p>\n<p>Though color vision disorders are common, they are not highlighted enough which is why the Pro Visu Foundation wanted to provide citizens, with or without these disorders, an application enabling them to:<\/p>\n<ul>\n<li>Estimate the level of their color vision (or the degree of their lack of color vision) using the Ishihara Test.<\/li>\n<li>Experience the vision of patients with these visual problems.<\/li>\n<li>Access quality information content on disorders of color vision.<\/li>\n<\/ul>\n<p>The purpose of this application is to provide reliable tools for information, promotion and prevention related to disorders of color vision. It&nbsp;is designed for citizens who want to learn more about vision color disorders. This information does not replace the need for a medical consultation and is not intended to diagnose a condition. It is therefore important to consult your eye doctor regularly and to contact him\/her in case of need, as they can perform these tests to come to a proper diagnosis.<\/p>\n<p>The vision simulator and the color recognition tool depends on the performance of the screens such as mobile screens, smartphone screens and computer screens as well as the camera devices used. Each of these screens has different technical characteristics and displays different screens resolutions, so please note that the displayed results may be limited and differ depending on the device used.<\/p>\n<p>The application was entirely financed by the Pro Visu Foundation, a Swiss private law foundation and does not display advertising.<\/p>\n<h3>Editorial&nbsp;policy<\/h3>\n<p>This application&nbsp;respects the 8 principles of the HONcode, a code of conduct for health websites. Verification here:&nbsp;<a class=\"button--quiet\">https:\/\/www.healthonnet.org\/HONcode\/Conduct.html?HONConduct039737<\/a><\/p>\n<p>Director of publication : C&eacute;lia Boyer, director of the HON Foundation.<\/p>\n<p>Committee of editors: Aude Cabrera, Nurse; Mayoni Ranasinghe, Medical Doctor.<\/p>\n<p>None of the authors, employees of the HON Foundation, have any conflict of interest to declare with commercial organisations.<\/p>\n<h3>Privacy policy<\/h3>\n<p>The application only stores preferences selected by the user when making use of it (colors used, selected language), on the device used by the user. HON does not retain or store any data elsewhere.<\/p>\n<h3>References&nbsp;<\/h3>\n<p><label>Ishihara Test:<\/label><\/p>\n<ul>\n<li><a class=\"button--quiet\"> http:\/\/www.richmondproducts.com\/files\/3113\/1550\/1433\/5566_Ishihara_38_Plate_Instructions_and_score_sheet_071410.pdf<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.ftpuso.com\/manuals\/Luxvision\/Ishihara%20-%2038.pdf<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.colour-blindness.com\/colour-blindness-tests\/ishihara-colour-test-plates\/<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.color-blindness.com\/ishiharas-test-for-colour-deficiency-38-plates-edition\/<\/a><\/li>\n<li><a class=\"button--quiet\"> https:\/\/en.wikipedia.org\/wiki\/Color_blindness#Deuteranopia<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.color-blindness.com\/ishihara-38-plates-cvd-test\/<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.archimedes-lab.org\/colorblindnesstest.html<\/a><\/li>\n<\/ul>\n<p><label>Content Information: <\/label><\/p>\n<ul>\n<li><a class=\"button--quiet\"> http:\/\/orthoptie.net\/ToposFB\/rabcld.pdf<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.doctissimo.fr\/html\/sante\/bien_voir\/sa_4944_daltonisme.htm<\/a><\/li>\n<li><a class=\"button--quiet\"> https:\/\/ghr.nlm.nih.gov\/condition\/achromatopsia#genes<\/a><\/li>\n<li><a class=\"button--quiet\"> http:\/\/www.color-blindness.com\/protanopia-red-green-color-blindness\/<\/a><\/li>\n<\/ul>\n<p><label>Color identification tool:<\/label><\/p>\n<p>This tool uses an external library (Library NTC.js, project \"Name that color\" under CC BY 2.5 license), and the initial project has undergone some changes with the consent of the author, to match our application.<br \/> <a class=\"button--quiet\">https:\/\/creativecommons.org\/licenses\/by\/2.5<\/a><br \/> <a class=\"button--quiet\">http:\/\/chir.ag\/projects\/ntc<\/a><\/p>\n<p>For questions, you can contact the HON Foundation: <a href=\"mailto:provisu@healthonnet.org\"><span class=\"button--quiet\">provisu@healthonnet.org<\/span><\/a><\/p>\n<p>Date last updated: <span class=\"avoid-clicks toolbar-button--quiet\">November 2016<\/span><\/p>","YOUR_ANSWER":"Your answer","FOOTER":"Copyright © 2016 Pro Visu - HON - v1.0.3","MODAL_ISHIHARA_TEST_DISCLAIMER":"<p>Short test : 6 plates<\/p>\n<p>If the results are inconclusive, a long test is suggested.<\/p>\n<p>Long test : 25 digital plates.<\/p>\n<p>The original test includes 38 plates. Plates 1 to 25 are designed for people who can read numbers. We&nbsp;decided to use only these ones, in order to favour a quick test.<\/p>\n<p>This test is designed to give a quick assessment of color vision deficiency, and should not replace evaluation by a professional.<\/p>","ISHIHARA_TEST_DISCLAIMER":"Ishihara test","DEUTERANOMALY_AUDIO":"","PROTANOMALY_AUDIO":"","DEUTERANOPIA_AUDIO":"","PROTANOPIA_AUDIO":"","TRITANOPIA_AUDIO":"","ACHROMATOPSIA_AUDIO":""}
