{
  "NORMAL": "normal",
  "ABOUT": "about",
  "OPTIONS": "options",
  "HOME": "home",
  "VISION_SIMULATOR": "vision simulator",
  "COLOR_PICKER": "color picker",
  "AR_MODE": "A.R. mode",
  "CLASSIC_MODE": "classic Mode",
  "DEUTERANOMALY": "deuteranomly",
  "DEUTERANOPIA": "deuteranopia",
  "PROTANOMALY": "protanomaly",
  "PROTANOPIA": "protanopia",
  "TRITANOPIA": "tritanopia",
  "ACHROMATOPSIA": "achromatopsia",
  "ENCYCLOPEDIA": "encyclopedia",
  "BACK": "back",
  "NEXT": "next",
  "START": "start",
  "RESTART": "restart",
  "RESULTS": "results",
  "BACK_TO_MENU": "back to menu",
  "EXPECTED": "expected",
  "YOUR_ANSWER": "your answer",
  "COMPLETE_TEST": "complete test",
  "YOUR_RESULT": "your result",
  "TEST_ISHIHARA_NORMAL": "normal vision",
  "TEST_ISHIHARA_PROBLEM": "diagnostic problem",
  "TEST_ISHIHARA_COLOR_BLIND": "achromatopsia suspected",
  "TEST_ISHIHARA_COLOR_PROTANOMALY": "protanomaly suspected",
  "TEST_ISHIHARA_COLOR_DEUTERANOMALY": "deuteranomaly suspected",
  "TEST_ISHIHARA_COLOR_DEFICIENCY": "color deficiency suspected",
  "SHORT_TEST": "short test",
  "NO_NUMBER": "no number",
  "CHANGE_THEME": "change color theme",
  "CHANGE_LANGUAGE": "change language",
  "RED": "red",
  "DARK_RED": "dark red",
  "LIGHT_PINK": "light pink",
  "PINK": "pink",
  "DARK_PINK": "dark pink",
  "ORANGE": "orange",
  "YELLOW": "yellow",
  "LIGHT_GREEN": "light green",
  "GREEN": "green",
  "DARK_GREEN": "dark green",
  "BLUE_GREEN": "blue - green",
  "LIGHT_BLUE": "light blue",
  "BLUE": "blue",
  "DARK_BLUE": "dark blue",
  "VIOLET": "violet",
  "BEIGE": "beige",
  "BROWN": "brown",
  "BLACK": "black",
  "GREY": "grey",
  "DARK_GREY": "dark grey",
  "WHITE": "white",
  "TOPIC_HEADER_COLORBLINDNESS": "Explications troubles de la vision des couleurs",
  "TOPIC_HEADER_TESTS": "Explications des Tests",
  "INTRODUCTION_TITLE":"introduction",
  "INTRODUCTION_CONTENT":"<p>L’œil est capable, grâce à des cellules rétiniennes appelées cônes, de percevoir les couleurs fondamentales (rouge, vert, bleu). Puis, ces cellules transmettent l’information au cerveau par le biais du nerf optique, dans une zone du cortex cérébral spécialement dédiée à la reconnaissance des couleurs.<br/> Les déficiences de la vision sont appelées dyschromatopsies </p> <p>Elles sont héréditaires, comme le daltonisme, ou acquises suite à une maladie oculaire.</p>",
  "DALTONISM_TITLE":"Daltonisme - Dyschromatopsies héréditaires",
  "DALTONISM_CONTENT":"<p>La fréquence des daltoniens est, en moyenne, de 8 % dans la population masculine et 0,5 % dans la population féminine.<br/> Cette disparité est due au fait que le gène du daltonisme est porté par le chromosome sexuel X et qu'il est récessif, c'est-à-dire qu'il suffit de la présence d'un gène normal pour que l'anomalie ne s'exprime pas. </p> <p>La femme ayant deux chromosomes X, elle n'est daltonienne que si ces deux chromosomes, hérités de ses deux parents, portent le gène défectueux, éventualité rare.</p><p>En revanche, l'homme possédant un seul chromosome X, hérité de sa mère, il suffit que cette dernière lui ait transmis le gène anormal pour qu'il soit daltonien. </p> <p>Le daltonien ne dispose pas des 3 canaux normaux pour former les couleurs.</p>",
  "DICROMATE_TITLE":"Dichromate",
  "DICROMATE_CONTENT":"<p>Un des canaux est absent, il ne forme les couleurs qu’à l’aide de 2 canaux au lieu des trois habituellement utilisés. </p> <ul><li><strong>protanope </strong> : ne voit que le vert et le bleu, le rouge est absent.</li> <li><strong>deutéranope </strong>(le plus fréquent) : ne voit que le rouge et le bleu, le vert est absent.</li> <li><strong>tritanope</strong> : ne voit que le rouge et le vert, le bleu est absent.</li></ul>",
  "TRICHROMATE_TITLE":"Trichromate",
  "TRICHROMATE_CONTENT":"<p>Trichomate anormal: les trois canaux sont présent mais un est déficient</p> <ul><li><strong>protanomal</strong> : le rouge est déficient</li> <li><strong>deutéranomal </strong> : le vert est déficient</li><li><strong>tritanomal</strong> : le bleu est déficient</li></ul>",
  "ACHROMATE_TITLE":"Achromate",
  "ACHROMATE_CONTENT":"<p>C’est l’absence totale de perception des couleurs. Celui qui est atteint voit le monde en noir et blanc et des nuances de gris. Les cônes de cornée sont dépourvus des 3 pigments habituels qui permettent de voir les couleurs.</p><p>Les cellules visuelles ne se régénérant pas, ces troubles de la vision sont définitifs et incurables.</p>",
  "ACQUIRED_TITLE":"Dyschromatopsies acquises",
  "ACQUIRED_CONTENT":"<p>Cela correspond à un trouble consécutif à une maladie oculaire. L’altération de la vision des couleurs apparaît souvent au début de la maladie, et peut donc être curable.</p>",
  "ISHIHARA_TITLE":"Test d'Ishihara",
  "ISHIHARA_CONTENT":"<p>Ce test a été créé en 1917 par Ishihara Shinobu.</p><p>Il est composé de 38 planches dites « pseudo-isochromatiques », soit de planches faites de petites pastilles colorées formant un fond sur lequel apparaît un symbole (lettre ou chiffre).</p><p>Le patient non atteint de dyschromatopsie distingue clairement le symbole, tandis que le patient atteint ne réussit pas à lire le symbole.</p><p>Son but est de pouvoir mettre en évidence l’existence d’une dyschromatopsie si elle existe, ainsi que son axe. Il ne permet pas d’évaluer la gravité de la déficience.</p><p>Dans cette application, nous vous proposons de réaliser tout d’abord le test court composé de 6 tuiles, puis si les résultats ne sont pas concluants, de réaliser la version longue du test, composée de 25 tuiles numériques.</p><p>Ce test ne remplace pas l’avis d’un professionnel de santé.</p>",
  "ISHIHARA_MORE":"<em><p>(Plus détaillé : Cet album est constitué de 38 planches dont les motifs peuvent être des chiffres (planches 1 à 25) ou des serpentins (planches 26 à 38). Les planches peuvent être de différentes natures : </p><ul><li>2 planches de démonstration (chiffres : planche 1, serpentins : planche 38). </li><li>12 planches de confusion (chiffres : planches 2 à 9, serpentins : planches 34 à 37).</li><li>12 planches d'épreuve (chiffres : planches 10 à 17, serpentins : planches 30 à 33).</li><li>6 planches de contre-épreuve (chiffres : planches 18 à 21, serpentins : planches 28 et 29). </li><li>6 planches de diagnostic qualitatif (chiffres : planches 22 à 25, serpentin : planches 26 et 27). </li></ul><p>Il n'y a pas de planches de diagnostic quantitatif, de planches sans motif, ou de planches d'axe bleu-jaune. Le sujet est considéré comme normal, s'il lit au moins 17 des 21 planches à chiffres, et anormal, s'il lit au maximum 13 planches.)</p></em>",
  "FARNSWORTH_TITLE":"Test 100 HUE de Farnsworth",
  "FARNSWORTH_CONTENT":"<p>Ce test est un test de classement conçu par Dean Farnsworth en 1943.</p><p>Il consiste à classer les différentes couleurs afin de former une suite de couleurs dégradées.</p><p>Il met ainsi en évidence un « axe de confusion », car le sujet atteint de troubles de la vision des couleurs classe des couleurs opposées l’une à côté de l’autre et il est ainsi possible de remarquer quels sont les tons confondus.</p><p>Ce test ne remplace pas l’avis d’un professionnel de santé.</p>",
  "MODAL_SIMULATOR":"<p>Cet outil simule la vision qu’ont les patients atteints de troubles de la vision des couleurs.</p><p>Grâce à la caméra de votre appareil, vous pourrez voir ce que voient ces patients, les simulations de 6 pathologies visuelles sont disponibles.</p>",
  "MODAL_COLOR_PICKER":"<p>Cet outil vous permet, via la caméra, de sélectionner les couleurs que vous voyez et de les nommer précisément. L’outil reconnaît la couleur sélectionnée via la caméra et vous donne son nom exact, pouvant ainsi aider les personnes atteintes de troubles visuels à choisir leurs vêtements, ou à savoir quelle est la teinte sélectionnée.</p>"
}

